package cycles.whilecycle;

public class WhileTaskCapitalization {
    //посчитать сложный процент . То есть ввести сумму и посчитать с учетом сложного процента , который начисляется каждый год, сколько будем накоплено через 10 лет?
    //Эту задаччу можно будет решить с помощью for

    //вторая задача. Вывести сколько нужно лет копить при вкладе 100 000 до суммы 1 000 000 при процентной ставке 7%
    //3 задача

    //отсылка на то как правильно считать числа - знайте, что данная задача является упрощением при работе с деньгами.
    public static void main(String[] args) {




    }
}
