package arrays;
/* Задача: Дан массив целых чисел и ещё одно целое число.
Целое число получать с клавиатуры.
Удалите все вхождения этого числа из массива (пропусков быть не должно).
Необходимо вывести на экран числа от 5 до 1. На экране должно быть:
5 4 3 2 1

*/
import java.util.Arrays;

public class ArrayPractice17Sort {
    public static void main(String[] args) {
        int[] firstArray = {1,2,3,4,5};
        for (int i = 0; i < firstArray.length; i++) {
        }
        System.out.println();
    }
}
